{"reddit_post": "Even when people are clearly joking I still get insecure and a little hurt. I do my best not to show it but i think to the more perceptive folks it's probably obvious.\n\nZooming out from that it always feels stupid that I feel that way because I know it was just a joke but in the moment it still hurts. I really just can't not give a fuck..\n\nI get that heavy chest feeling and it stays with me for days when someone insults me. It's so stupid. I know it's rooted deeper like problems I have with my dad and family and being accepted but it still annoys me.\n\nIs there any fix to this?", "appraisal_dimension_id": "1", "appraisal_dimension": "self-responsibility", "appraisal_dimension_aim": "To guide the narrator over their perception of their responsibility for causing the situation.", "constitution": "If the narrator is stressing over things they are not responsible for, tell them that it may not require as much responsibility as they think and not to worry about them too much (depending on how high they perceive their level of responsibility in the situation). However, if the person is doing something wrong/inappropriate and not feeling any responsibility or it (low responsibility), you should kindly but objectively encourage them to re-appraise the situation (or maybe think in the other person’s perspective) and consider what they could be responsible for, and change the situation. Provide realistic and specific guidelines."}
{"reddit_post": "I asked my friend a question and it became a much bigger deal that it was suppose to be. Not feeling okay at all and very anxious. I have pretty bad social anxiety and even being around my friends makes me anxious. Well, my bestfriend and her boyfriend are moving next week so they came over to my apartment last night to sleep over and have some drinks. It was me, my fiance, my bestfriend, her boyfriend, and our friend Josh.\n\nWe were on the topic of our ethnicities and discussing our ethnicities. Everyone was okay until I asked Josh if he was jewish. I asked this because my bestfriend told me he was jewish literally two weeks. I don't see or talk to Josh much so I believed my bestfriend when she said he was jewish. I simply just wanted to extend the conversation and get to know Josh better and it fit in with the conversation we were having. But, when I asked that, my bestfriends boyfriend seriously grilled my ass for it and was treating it like I asked Josh that because I was racial profiling him. I had to defend myself for 30 minutes saying that I only asked that because my bestfriend, his girlfriend, told me that Josh was jewish. My bestfriend was quiet during this entire talk. It was getting kind of late and I was pretty upset that I was treated that way for simply asking a question so I told them im gonna head off to bed. But then that became a big issue and everyone got freaked out that I went to bed early. I mean my bestfriend has messed up my fiances ethnicities all the time and calls him things that he is NOT but we just go, 'oh hes not that,' and move on. But her boyfriend interrogated me for 30+ minutes over it. Now its the morning and the anxiety I feel is so bad I am actually shaking. They still slept over and I just want to crawl in a hole then to see them.", "appraisal_dimension_id": "4", "appraisal_dimension": "problem-focused_coping", "appraisal_dimension_aim": "To guide the narrator over their perception of their ability to cope with the consequences of the event.", "constitution": "You should tell the narrator to focus on the problem at hand, and encourage them to ask themselves whether the issue is in their control or not. If any part of the issue is in their control, start breaking down the problem into manageable steps and develop a detailed plan to tackle each aspect (like a to-do list). If the narrator feels overwhelmed to do this alone, don’t hesitate to look for support from friends/family. Do not be overwhelmed by the scope of the issue; they could focus on the task they have narrowed down on the to-do list. Encourage them to find joy in striking off items from this list, focusing on the accomplishments. Without even realizing it, they will find themselves feeling empowered, having taken control of the situation. After accomplishing them, if needed re-evaluate the situation and repeat the process!"}
{"reddit_post": "New level of anxiety unlocked: I can't sleep beside someone. Have been sleeping by myself since I was a young teen. But soon in college I felt alone and restless.\n\nThis time I slept beside someone I love butthe irony is, I was too conscious about breathing heavily, moving around, thinking if they are awake. And now it's a bummer cuz I don't want to sleep beside anyone ever. I thought sleeping beside someone you are close to reduces stress and improves sleep.\n\nEnded up sleeping on the couch. Instant relaxation.", "appraisal_dimension_id": "6", "appraisal_dimension": "attentional_activity", "appraisal_dimension_aim": "To guide the narrator over their perception of the need to attend to the situation further.", "constitution": "You should tell the narrator to examine whether the situation at hand is worth their attention. If it’s not, encourage the narrator to focus on other important things. Encourage the narrator to find something that’s easier and less stressful to tackle."}
{"reddit_post": "I am visiting family this week. All of my family members who are eligible for the vaccine, including myself. have gotten vaccinated. The only people who arent are my niece and nephew, because they are only 4 and 1 years old. I wanted to see an old friend from high school, but I found out that this friend did not get vaccinated. My brother and sister in law are asking that I avoid seeing people who are not vaccinated since their children cannot be vaccinated. Is it too much to completely avoid seeing this person at the wishes of my brother, or would it be safe enough to see this person in an outdoor setting socially distanced? I know this is a stupid question, but Im curious what you all would do.", "appraisal_dimension_id": "7", "appraisal_dimension": "emotion-focused_coping", "appraisal_dimension_aim": "To guide the narrator over their perception of their ability to emotionally cope with the consequences of the event.", "constitution": "You can ask the narrator to recognize what is upsetting them. Encourage the narrator to think of ways to reduce negative emotions, control their (negative) feelings, and avoid situations, individuals, objects, or memories that trigger such negative emotions or upset them."}
{"reddit_post": "Lately, I keep trying to distract myself and have been trying to go out, but honestly I just find myself worrying that things are going to be like this forever. I hate everything from taking classes online to working from home. I sometimes feel like I am just not handling anything well at all, and keep wondering what even is the point to anything anymore.", "appraisal_dimension_id": "8", "appraisal_dimension": "self-controllable", "appraisal_dimension_aim": "To guide the narrator over their perception of their ability to control what was happening in the situation.", "constitution": "You can tell the narrator whether the situation is within their control (based on your (in third-person view) judgment). Guide the narrator on how to control the situation specifically: they can face it directly and find a solution, seek help from others (close friends, family, or professionals), or take a mental break and then re-evaluate the situation, whether it calls for their action (intervention) or not."}
{"reddit_post": "Been struggling with this all my life. I'm currently typing this out on a busted up phone, because I can't seem to stop throwing it when I'm upset.\n\nI hate feeling this way all the time, and constantly looking like a child. My family is used to it, so they don't care anymore - I mean, how could they? This is almost a daily thing.\n\nBut for me, it always feels like the world is actually falling apart *this* time. It never does. It's always just me spinning out in my imaginary world of torment.\n\nI just want to be done.", "appraisal_dimension_id": "23", "appraisal_dimension": "consistency_with_internal_values", "appraisal_dimension_aim": "To guide the narrator over their perception of how consistent the situation was with their personal values.", "constitution": "Tell the narrator that in situations where multiple people interact, conflicts of internal values may arise. What the narrator values is important; however, it may not always be suitable depending on the situation. Communicating amicably with others is vital if the situation aligns with the narrator's beliefs. On the other hand, if the situation contradicts the narrator's beliefs, it's essential to re-appraise the situation and think from others’ perspectives. For instance, if the narrator firmly believes that everyone should adopt a vegan lifestyle, it's important to acknowledge the validity of that viewpoint. Yet, remind the narrator that conflicts of interest and belief can arise in certain contexts, and misunderstandings might emerge due to a lack of context or background knowledge."}